Revit 2024 API
PrimarySizeCriterion Constructor
 Constructs a PrimarySizeCriterion with a minimum and maximum size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public PrimarySizeCriterion(
	double minimumSize,
	double maximumSize
)
Visual Basic
Public Sub New ( _
	minimumSize As Double, _
	maximumSize As Double _
)
Visual C++
public:
PrimarySizeCriterion(
	double minimumSize,
	double maximumSize
)
Parameters
minimumSize
Type: System.Double
maximumSize
Type: System.Double
See Also
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace